[
    {
        "Education": [
            {
                "title": "University of Michigan",
                "subtitle": "B.S.E Computer Science, '22",
                "text": "3.93 GPA, University Honors, Dean's List",
                "dates": "September 2018 - Present"
            }
        ]
    },
    {
        "Work Experience": [
            {
                "title": "Citadel",
                "subtitle": "Incoming Software Engineering Intern",
                "text": "Citadel Execution Services team.",
                "dates": "September 2021 - December 2021"
            },
            {
                "title": "Nuro",
                "subtitle": "Software Engineering Intern",
                "text": "Reduced time to clone Git monorepo from 10 minutes to 1.5 minutes. Made bazel builds 10% faster and immune to missing external dependencies.",
                "dates": "May 2021 - August 2021"
            },
            { 
                "title": "Uber",
                "subtitle": "Software Engineering Intern",
                "text": "Launched personalization based on user food preference data to shortcuts feature on Uber Eats Home page so users can navigate to their most used places in app with one tap.",
                "dates": "May 2020 - August 2020"
            },
            {
                "title": "Kare",
                "subtitle": "Co-Founder & Director of Engineering",
                "text": "Created a social media application in a wellness vertical in React Native, complete with online groups for college students to discuss topics and do daily wellness exercises together. Launched to iOS App Store with over 100 users.",
                "dates": "March 2020 - Present"
            },
            {
                "title": "Larky",
                "subtitle": "Software Engineering Intern",
                "text": "Implemented functionality for users to edit scheduled push notifications on a React dashboard after creation.  Led full stack (Node.js, React.js, Android) development of suppressed notifications feature, an urgent client request.",
                "dates": "May 2019 - August 2019"
            },
            {
                "title": "Crowds and Machines Lab",
                "subtitle": "Undergraduate Researcher",
                "text": "Conducted research to develop tools for students to write more readable code.",
                "dates": "March 2019 - January 2020"
            }
        ]
    },
    {
        "Courses": [
            {
                "title": "Operating Systems",
                "subtitle": "EECS 482",
                "text": "Operating System implementation and design. Made a multi-cpu threading library with mutex locks and conditional variables, a virtual pager, and a network file system.",
                "dates": "Winter 2020"
            },
            {
                "title": "Computer Vision",
                "subtitle": "EECS 442",
                "text": "Classical methods for computer vision (camera calibration, homography) and deep learning methods for computer vision. Created a tool that estimates physical distance traveled of a person from a smartphone video.",
                "link": "https://bit.ly/ballerstats",
                "dates": "Winter 2021"
            },
            {
                "title": "Machine Learning",
                "subtitle": "EECS 445",
                "text": "Created a CNN to classify clothing pictures and used n-grams to perform sentiment analysis on Yelp reviews. Machine Learning algorithm theory and projects, including perceptron, SVM, random forests, neural networks, and clustering.",
                "dates": "Fall 2020"
            },
            {
                "title": "Algorithms",
                "subtitle": "EECS 477",
                "text": "In-depth analysis and implementation of algorithms, including divide and conquer, fast fourier transform, dynamic programming, fibonacci heaps, hashing, DFS/BFS, min flow max cut, and linear programming.",
                "dates": "Fall 2020"
            },
            {
                "title": "Data Structures and Algorithms",
                "subtitle": "EECS 281",
                "text": "Fundamentals of data structures and algorithms including stacks, queues, hash tables, trees, graphs, greedy algorithm, divide and conquer, and dynamic programming. Finished projects involving DFS/BFS, priority queues, hash tables, and backtracking.",
                "dates": "Fall 2019"
            },
            {
                "title": "Computer Organization",
                "subtitle": "EECS 370",
                "text": "opics include datapath, pipelining, caches, virtual memory.",
                "dates": "Fall 2019"
            },
            {
                "title": "Elementary Analysis",
                "subtitle": "Math 451",
                "text": "Proving the foundations of calculus on the real line.",
                "dates": "Winter 2021"
            },
            {
                "title": "Abstract Algebra",
                "subtitle": "Math 412",
                "text": "Topics include modular arithmetic, polynomials, rings, and groups.",
                "dates": "Winter 2020"
            }
        ]
    },
    {
        "Projects": [
            {
                "title": "Spotify Mixer",
                "subtitle": "Autogenerated group playlists",
                "text": "Make a playlist for you and your friends, full of everyone's favorite songs, with the click of a button",
                "link": "https://spotifymixer.com"
            },
            {
                "title": "Michigan Voting Quiz",
                "subtitle": "Educational Quiz",
                "text":"A quick quiz to communicate key information about voting in Michigan. Played 200+ times.",
                "link": "https://michiganvotingquiz.org"
            },
            {
                "title": "Codenames",
                "subtitle": "Web Game",
                "text":"An online version of the popular card game, Codenames. Built with React.js and Firebase Cloud Firestore.",
                "link": "https://codenames.co"
            },
            {
                "title": "EngageMe",
                "subtitle": "Chrome Extension",
                "text": "Second place winner of Best Use of Google Cloud at MHacks 12! A chrome extension that tracks and aggregates video engagement data for YouTube videos and lecture recordings in order to display over the watch bar the most interesting parts of a video for new viewers.",
                "link": "https://bit.ly/Engage-Me"
            },
            {
                "title": "Storeback",
                "subtitle": "Web API",
                "text": "Serves as the back end for online stores built with Flask and SQLAlchemy. Manages sign in/sign out, users, carts, and inventory for online stores.",
                "link": "https://rguan72.github.io/StoreBack-Landing-Page/"
            },
            {
                "title": "SnapCal",
                "subtitle": "Web App",
                "text": "When users take pictures of fliers with SnapCal, the text is extracted using Google Cloud Vision API and any flier events are automatically added to the user's Google Calendar."
            }
        ]
    },
    {
        "Student Organizations": [
            {
                "title": "180 Degrees Consulting",
                "subtitle": "Consulting Club",
                "text": "Consulted for nonprofit microfinance company and Russian fast mover consumer goods company.",
                "dates": "January 2020 - Present"
            },
            {
                "title": "Solar Car",
                "subtitle": "Software Team",
                "text": "Built rooms functionality for team World Solar Challenge real-time racing simulator.",
                "dates": "September 2018 - February 2019"
            },
            {
                "title": "MPowered",
                "subtitle": "Software Team",
                "text": "Marketed and ran a pitch component for high schoolers.",
                "dates": "September 2018 - May 2019"
            }
        ]
    }
]